_posts/2020-07-14-reinstall-nvidia-drivers.html
---
date: 2020-07-14 00:00
author: Manoel Vilela
title: Reinstall NVIDIA drivers at shutdown
excerpt: The master solution for slavery problems
categories:
- programming
tags:
layout: post
comments: true
---
<link rel="stylesheet"
      href="/assets/css/style.css"
      type="text/css"/>

<p>
<i>Disclosure</i>: essa solução é a coisa mais porca e funcional que já fiz na
minha vida em manutenção de sistemas.
</p>

<div id="outline-container-orge739ffd" class="outline-2">
<h2 id="orge739ffd">Background</h2>
<div class="outline-text-2" id="text-orge739ffd">
<p>
Eu tava tendo vários problemas com meu sistema operacional do
computador de mesa, que além de ter um hardware já datado (10+ anos),
possuí uma placa de vídeo nvidia (GT 240) que constantemente tem me
dado dor de cabeça durante quase toda minha jornada com o Linux. Acho
que a única distribuição Linux que não tive muitos problemas foi o
Manjaro e o Artix.
</p>

<p>
Mas então, por questão de simplicidade multiusuário &#x2013; outras pessoas
tem usado esse computador agora &#x2013; instalei o Linux Mint desde que
perdi todos meus sistemas principais &#x2013; resumo de uma longa história:
(2019) artix random upgrade bug caused kernel panic at boot + (2020)
ransomware no windows por causa de uma criança estúpida querendo
baixar fortnite.
</p>
</div>
</div>

<div id="outline-container-orge14c139" class="outline-2">
<h2 id="orge14c139">Real problem</h2>
<div class="outline-text-2" id="text-orge14c139">
<p>
De toda maneira, cortando o lenga-lenga &#x2013; ou uma parte dele &#x2013; tenho
usado Linux Mint desde então (2020) depois de fugir por alguns anos de
sistemas baseado em debian/ubuntu e systemd. Por alguma razão estranha, após
alguns upgrades (distro version upgrade, pensa numa parada pra dar
merda! rolling release rules) eu finalmente cheguei numa
versão&#x2026; mais <b><b>bugada ainda</b></b> pra minha felicidade.
</p>

<p>
Toda vez que eu reiniciava meu computador simplesmente não funcionava
mais o driver de vídeo. O X11 entrava em loop e eu se quer conseguia
acionar o console via Ctrl+Alt+FN, ficava tudo travado; minha única
opção era reiniciar naquele ponto ou destruir essa desgraça &#x2013;
brincadeira, esse computador foi o início de tudo. No fim das contas,
o fluxo padrão de uso desse computador funcionava da seguinte maneira:
toda vez que eu desligava, ao ligar novamente percebia que tava tudo
fudido, então eu reiniciava de NOVO para então entrar no modo de
recuperação, dava um jeito de acionar os serviços de rede (que depois
de um tempo fazendo manualmente percebi que tinha uma OPÇÃO pra ativar
pra você) e reinstalar os drivers de vídeo da nvidia com o seguinte
comando:
</p>

<div class="org-src-container">
<pre class="src src-shell">apt install --reinstall nvidia-340
</pre>
</div>

<p>
Toda vez, toda <b><b>santa vez</b></b>, que reiniciava ou desligava eu tinha que
fazer essa merda. Claro, depois de corrigir eu reiniciava de novo. Só
nisso já foi três restarts (o que deu ruim, a correção e o sistema
funcionando de novo).
</p>

<p>
Sabe o que pensei? Quer saber, bora vê aqui se nesse SystemDeus tem um
jeito de usar um hook pra executar um comando antes de
desligar/reiniciar. Afinal, se essa porra toda sempre acontece depois
de desligar, eu corrigindo antes de desligar deve funcionar, não?
</p>
</div>
</div>

<div id="outline-container-org9b721e0" class="outline-2">
<h2 id="org9b721e0">Master solution</h2>
<div class="outline-text-2" id="text-org9b721e0">
<p>
Pois então, aí vamos lá. Eu fiz o seguinte, após uma breve pesquisa e
verifiquei que quase ninguém sabe direito como faz pra isso funcionar,
ou quando sabe fazer funcionar não sabe porque funciona, coletando os
fragmentos de conhecimentos espalhados pelas threads encontradas,
escrevi o seguinte serviço em
<code>/etc/systemd/system/reinstall-drivers.service</code>:
</p>

<div class="org-src-container">
<pre class="src src-text">[Unit]
Description=Reinstall Nvidia Drivers
DefaultDependencies=no
Before=shutdown.target reboot.target halt.target
After=network.target network-online.target
Wants=network.target network-online.target


[Service]
ExecStart=/usr/local/bin/apt install --reinstall nvidia-340 -y
Type=oneshot


[Install]
WantedBy=shutdown.target reboot.target halt.target
</pre>
</div>

<p>
Logo então, acionei os seguintes comandos:
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo systemctl daemon-reload
sudo systemctl enable reinstall-drivers
</pre>
</div>

<p>
Fiz reboot e testei. Funcionou! Fiz reboot de novo e funcionou
novamente. Espero que continue funcionando. A parte chata é só a
demora de cerca de 3min agora pra desligar/reiniciar, afinal toda vez
vai ser reinstalado o driver de vídeo, mas é muito
melhor que fazer toda essa desgraça manualmente.
</p>

<p>
Invés de ser escravo de computador, prefiro que o computador seja
escravo de si mesmo.
</p>
</div>
</div>
<div id="outline-container-org250c25b" class="outline-2">
<h2 id="org250c25b">Edit: SystemDestroyed</h2>
<div class="outline-text-2" id="text-org250c25b">
<p>
<i>Post</i> atualizado em: <code>&lt;2020-09-04 Fri&gt;</code>
</p>

<p>
Na real, essa porra de ficar reinstalando não é muito
confiável. Depois de um mês e meio usando essa solução, às vezes isso
funciona, às vezes não. O <i>systemd</i> nunca foi muito confiável, mas
eu supus que pelo menos pra fazer ativação correta dos serviços poderia
se confiar. Nem isso.
</p>

<p>
Às vezes os <i>drivers</i> eram reinstalados quando o computador desligava,
mas nem sempre &#x2013; também não sei o porquê isso acontecia. Além disso,
se o computador fosse desligado abruptamente já era, aí não
funcionaria mesmo a reinstalação no desligamento. Tentei também deixar
o serviço rodando na inicialização do sistema, embora demorasse muito
o computador pra desligar, iria assegurar que iria pelo menos
ligar. Mas também não funcionou muito bem. <b><b>ÀS VEZES</b></b> funcionava.
</p>

<p>
Por esse motivo, eu resolvi usar uma propriedade do sistema dos
arquivos e simplesmente marcar o atributo de imutabilidade como ativo
para os arquivos de driver da nvidia. Uma solução brutal, mas que
funcionou bem. Nesse caso, precisei rodar os seguinte comandos com
permissão de administrador:
</p>

<div class="org-src-container">
  <pre class="src src-shell">
    sudo chattr +i /lib/modules/$(uname -r)/kernel/drivers/video/nvidia_uvm.ko
    sudo chattr +i /lib/modules/$(uname -r)/kernel/drivers/video/fbdev/nvidia/nvidiafb.ko
</pre>
</div>

<p>
Para checar se a mudança teve efeito observa-se a inclusão do atributo de
imutabilidade <code>i</code> via <code>lsattr</code>:
</p>

<pre class="example">
lsattr /lib/modules/$(uname -r)/kernel/drivers/video/nvidia_uvm.ko
lsattr /lib/modules/$(uname -r)/kernel/drivers/video/fbdev/nvidia/nvidiafb.ko
</pre>

<p>
Você deve receber uma resposta similar a:
</p>

<pre class="example">
----i--------------- /lib/modules/5.4.0-42-generic/kernel/drivers/video/nvidia_uvm.ko
----i--------------- /lib/modules/5.4.0-42-generic/kernel/drivers/video/fbdev/nvidia/nvidiafb.ko
</pre>

<p>
O lado negativo dessa solução é que precisarei fazer esses comandos
toda vez que o <i>kernel</i> for atualizado. Talvez uma solução definitiva
seria assegurar que um <i>script</i> ativa os atributos de imutabilidade dos
<i>drivers</i> assim que são reinstalados. Mas isso é papo pra outra história.
</p>
</div>
</div>
